app/views/participants/show.html.erb

SELECT  "rosters".* FROM "rosters"  WHERE "rosters"."id" = ? LIMIT 1  [["id", "participant_id"]]
---
<% @l2 = Array.new %>
<% @participantinfo = Roster.where(participant_id: @participant.id) %>

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
---
<% @num = num %>
<% @l1 = Event.find_by id: @num %>

SELECT "locations".* FROM "locations" INNER JOIN "events_locations" ON "locations"."id" = "events_locations"."location_id" WHERE "events_locations"."event_id" = ?  [["event_id", 1]]
---
<h2><strong><%= @event2.name %></strong></h2>
<% @event2.locations.each do |j| %>

SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = 0 LIMIT 1
---
<% @num3 = num3 %>
<% @loc2 = Location.find_by id: @num3 %>