app/controllers/check_in_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "locations".* FROM "locations"  WHERE "locations"."tag" = 'locations' LIMIT 1
---
  def index
  @event = Event.find(params[:event_id])
  @location = Location.find_by(tag: params[:tag])

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "participants".* FROM "participants"  WHERE "participants"."email" = 'participant10@gmail.com' LIMIT 1
INSERT INTO "rosters" ("created_at", "event_id", "location_id", "participant_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-20 22:19:41.616999"], ["event_id", 1], ["location_id", 1], ["participant_id", 1], ["updated_at", "2015-04-20 22:19:41.616999"]]
---
  def success
  @event = Event.find(params[:event_id])
  @location = Location.find(params[:location_id])
  @participant = Participant.find_by(email: params[:email])

  respond_to do |format|
    if Roster.create(event_id: @event.id, location_id: @location.id, participant_id: @participant.id)