app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("created_at", "name", "tag", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-21 18:37:38.349684"], ["name", "Location 4"], ["tag", "gwqgh2"], ["updated_at", "2015-04-21 18:37:38.349684"]]